{
  "main_function": "QA Engineer",
  "main_qualities": "Test Automatisering | Kwaliteitsproces | Software Testing",
  "menu_resume": "CV",
  "menu_about_me": "Over mij",
  "menu_test": "Test-pagina",
  "menu_projects": "Projecten",
  "menu_contact": "Contact",
  "menu_home": "Home",
  "project_logo_hover": "Klik het logo",
  "project_gallery_close": "Sluit pagina",
  "project1_desc": "Maakte onderdeel uit van een DevOps team verantwoordelijk voor het maken van een nieuwe ‘look and feel’ van het hypotheek gedeelte van de Rabobank (mobiele) app. Daarnaast is er gewerkt aan het opzetten van een micorservice structuur. Ik was hier verantwoordelijk voor de algehele test aanpak en het de focus zetten op de creatie van een succesvol product. Naast het werk in het hypotheek team heb ik werk gedaan voor andere teams. Zo heb ik teams geholpen met de opzet van data driven development, test automatiserings opzet met diverse tools en een overkoepelende kwaliteits visie neergezet.",
  "project2_desc": "Zat hier in twee scrum teams met de focus op database systemen verantwoordelijk voor de winkels en producten. Ik was hier verantwoordelijk om de kwaliteit een stap vooruit te brengen.",
  "project3_desc": "Ik maakte deel uit van het team dat de eerste integratie tool tussen FedEx en TNT heeft gerealiseerd. Ik heb hier het testproces en scrumproces neergezet. De eerste versie van de tool was gerealiseerd in 100 dagen, hierbij kon de klant een pakket versturen waarbij de uitvoerder (TNT/FedEx) werd gebaseerd op de ingevoerde locaties.",
  "project4_desc": "Werkte in een scrumteam verantwoordelijk voor de vernieuwing en herstructuring van de Track & Trace applicatie. Na een paar maanden is er een MVP live gezet en daarna is het doorontwikkeld tot een volwassen tool die gebruikt wordt in meer dan 50 landen en meer dan 30 talen.",
  "project5_desc": "Hier zat ik in een scrumteam die verantwoordelijk was voor het maken van een planningssysteem voor het inplannen van uitzendkrachten. Ik was hier verantwoordelijk voor het testproces en heb me vooral gericht op de rekenmodules van de applicatie(s).",
  "project6_desc": "Ik was als testcoördinator verantwoordelijk voor de ST en FAT voor meerdere projecten. Projecten Gevangenwezen (GW), Selectie en Leonardo. GW en Selectie are Progress applications running on a Citrix server. In het GW systeem worden alle gegevens van gevangenen geregistreerd en onderhouden. Het Selectie systeem genereert nationale rapporten over gedetineerden. En het Leonardo project gaat over de geautomatiseerde geldstroom van financiële informatie van de gedetineerden door alle systemen van het ministerie",
  "project7_desc": "Ik maakte deel uit van een DevOps team die verantwoordelijk was voor de klantinformatie omtrent boekingen en het customer service systeem. Ik was hier verantwoordelijk voor het verbeteren van de test automatisering, de creatie van een gedeelde kwaliteits mindset in het team en het inzetten van klantdata in het ontwikkelproces. Echter door de vervelende omstandigheden onstaan vanuit het Corona virus kwam deze opdracht helaas voortijdig ten einde.",
  "project8_desc": "Ik maak deel uit van het QA team die verantwoordelijk is voor alle kwaliteitsaspecten van de mobiele Zenly app. Ik ben verantwoordelijk voor het opzetten van de testautomatisering en het automatisch draaien van de testen op de AWS Devicefarm. Dit voor zowel Android en iOS.",
  "project1_results": "• Set up automation tests for the most important business features on UI level, service level, the basics for performance testing and integrated all in the delivery pipeline (CI/CD).\n• Introduced team test sessions and pair testing to make the complete team aware of the product and its quality.\n• I created a team focus on data and results by introducing Google Analytics and setting up the complete data structure and dashboarding. The data was being used for refinements, test and development decisions.\n• Started impact mapping to get focus on the project goal.\n• Front-end bug fixes in Angular and TypeScript.\n• Helped the department with the development of a generic testdata to be able to generate dynamic testdata.\n• Reformed user story template, making sure expectations and criteria were clear and given directions for testing, measuring and development.\n• Set up several test automation frameworks suitable for the different teams across the Rabobank\n• Improved measurement plans for gathering and realizing customer data and dashboards (technical and user data) for several teams.",
  "project2_results": "• Introduced UT PL/SQL for automated unit tests.\n• Created simple and easy to understand test templates.\n• Updated retrospectives to keep on improving with the teams.\n• Pair testing with the developers to create better test awareness.\n• Optimized the software release process by reducing the amount of people to check quality standards (keeping the team responsible).\n• Set up automated tests integrated in jenkins pipeline for the new front end build in Outsystems.",
  "project3_results": "• Set up test automation (CI/CD) for the most important business features, BDD style.\n• Held demo sessions for the department, providing sprint updates and gathering feedback from audience\n• Introduced team test sessions to make team aware of test and quality.\n• Stabilized velocity with the team\n• Facilitated all scrum meetings\n• Worked with 3 amigo sessions\n• Introduced following up at least 2 retropoints every sprint for continuous improvement",
  "project4_results": "• Set up the test automation with BDD\n• Improved the test automation over the E-Commerce department reducing run time by 66%, mainly by focusing on automating only core business functionality\n• Used customer data to make a risk based test approach\n• Held demo festival sessions, interactive style of demoing. People came over at the team to interact with the new build features and respond to future developments\n• Pair testing with developers to spread the quality mindset in the team\n• Organised departemental bughunts, gathering loads of bugs over several applications. Found bugs where prioritized on relevant backlogs by product owners",
  "project5_results": "•\tUsed multiple testing techniques to exhaustively test calculation parts of the system\n•\tIntroducing BDD, setting up scenarios with users and integrate those in user stories\n•\tIntroducing test automation on UI level\n•\tAutomated webservice tests via SoapUI to shorten regression testing feedback time\n•\tSet up performance test for webservices, generating insights on performance trends during developement\n•\tLed UAT sessions with multiple users in a room, gathering defects and possible improvements\n",
  "project6_results": "• Creating a testplanning \n• Creating test plans\n• Writing project progress report\n• Reviewing functional designs, use cases and technical designs\n• Reporting test results in JIRA\n• Executing chain tests\n• Coordinating UAT\n• Writing release advices",
  "project7_results": "• Extending/implementing test automation framework \n• Create team test awareness\n• Pair testing\n• Reviewing functional designs and technical designs",
  "project8_results": "• Creating a test automation framework \n• Writing scripts\n• Running tests in AWS device farm (cloud)\n• Integrating testcase management system with test automation",
  "contact_phone": "06-49966968",
  "contact_skype": "daan_koolman@hotmail.com",
  "contact_mail": "daan@koolit.nl",
  "contact_prof_info": "-Lets make quality a matter of cause-",
  "resume_function": "QA Engineer",
  "resume_profile": "Daan is kritisch, analytisch sterk, heeft oog voor detail en streeft naar succesvolle producten. Hij gebruikt (klant)data om de beste test aanpak te kiezen bepalen inclusief de balans tussen automatisch en handmatig testen. Daan werkt het liefst in een Agile omgeving waarbij hij door middel van kritische vragen kwaliteit tot een team effort maakt. Hij wordt graag uitgedaagd en probeert altijd nieuwe tools en technieken toe te passen. om zo te blijven leren. Alles wordt context driven toegepast en is gericht op resultaten. Daan werkt als freelancer.",
  "resume_address": "Amsterdam",
  "resume_phone": "06-49966968",
  "resume_email": "daan@koolit.nl",
  "resume_phone_header": "Telefoon",
  "resume_mail_header": "Email",
  "resume_web_header": "Web",
  "resume_address_header": "Adres",
  "resume_job_title1": "Test Consultant",
  "resume_job_title2": "Tester",
  "resume_job_title3": "Tester",
  "resume_job_title4": "Tester",
  "resume_job_title5": "Test Consultant",
  "resume_job_title6": "Agile Tester",
  "resume_job_title7": "QA Engineer",
  "resume_job_title8": "QA Engineer",
  "resume_job_title9": "QA Engineer",
  "resume_job_title10": "QA Engineer",
  "resume_job_title11": "QA Automation Engineer",
  "resume_add_act_title1": "Product Practices Canvas",
  "resume_add_act_desc1": "Model ontwikkelt om het software ontwikkel proces en kwaliteit binnen een team/organisatie inzichtelijk te maken. Het model laat zien wat een team/organisatie doet om een succesvol product te realiseren en het biedt ‘practices’ om verbeteringen door te voeren.",
  "resume_add_act_title2": "'Customer data' presentatie op Flissi IT (Rabobank)",
  "resume_add_act_desc2": "Presentatie over verzamelen van gebruikers gegevens en hoe deze toe te passen in je ontwikkel proces (focus op Google Analytics).",
  "resume_add_act_title3": "Medeorganisator Testlab Eurostar Software Test Conference",
  "resume_add_act_desc3": "Robot challenges, blackbox puzzels, security test challenges, games, bughunts en API test challenges opgezet en gefaciliteerd voor het Eurostar testlab.\nBemande het testlab voor 4 dagen op de conferentie.",
  "resume_add_act_title4": "'Know your customer presentatie' op Testnet",
  "resume_add_act_desc4": "Presentatie over diverse manieren om relevante klantdata te verzamelen en hoe je deze in kan zetten in het software ontwikkel proces.",
  "resume_skill1": "Agile Ontwikkeling",
  "resume_skill2": "Test Automatisering",
  "resume_skill3": "Exploratief Testen",
  "resume_skill4": "Strategie ontwikkeling",
  "resume_skill5": "Javascript",
  "resume_skill6": "Teamwork",
  "resume_skill7": "Communicatie",
  "resume_skill8": "Kritisch denken",
  "resume_skill9": "Data Analyse",
  "resume_till_now": "04/2020 - heden",
  "resume_skill_header": "Vaardigheden",
  "resume_Profile_header": "Persoonlijke info",
  "resume_experience_header": "Ervaring",
  "resume_education_header": "Opleiding & Cursussen",
  "resume_activities_header": "Neven activiteiten",
  "about_cycling": "Ik kijk graag naar de grote wielerrondes zoals de Giro, Vuelta en Tour the France",
  "about_football": "Ik speel voetbal bij sv. de Meer in Amsterdam en ik kijk graag voetbal met vrienden of gewoon in mijn eentje",
  "about_pubquiz": "Ik doe iedere maand een pubquiz met een groep vrienden, altijd leuk om nieuwe dingen te leren :)",
  "about_ski": "Ik probeer zoveel mogelijk per jaar te skieen, vind ik fantastisch om te doen!",
  "about_mindgames": "Ik hou ervan om uitgedaagd te worden en om perplex te staan. Zodat je geen idee hebt wat er is gebeurd en je in je hoofd flink aan de slag moet om het te begrijpen, zoals bij goochelaars of strategische spellen",
  "about_drinks": "Ik houd er van om zo nu en dan een drankje te doen met een groep vrienden en tevens om uit eten te gaan met vriendin onder het genot van een goed glas wijn",
  "ppc_intro": "De Product Practices Canvas helpt een team of organisatie om effectief te reflecteren op hun huidige software ontwikkel proces en biedt practices om te verbeteren daar waar nodig. Practices zijn technieken en methoden om een bepaald resultaat te behalen. Elke practice is ontwikkeld om een specifiek doel te dienen of om een probleem tegen te gaan/op te lossen. Bij het toepassen van het model wordt er gestart vanuit de huidige situatie en stap voor stap wordt de gewenste situatie in kaart gebracht. Hierbij wordt er bij elke stap naar de gewenste situatie toe practices geboden die kunnen worden ingezet om de gewenste situatie te behalen. Het slidedeck hieronder loopt je door het Product Practices Canvas model heen:",
  "ppc_sheet1": "Wat doe jij om een succesvol product te creëren",
  "ppc_sheet1_explanation": "Iedere deelnemer schrijft op stickies wat zij doen aan activiteiten en technieken om een succesvol product te creëren",
  "ppc_sheet2": "Plot de stickies op de kwaliteits piramide",
  "ppc_sheet2_explanation": "In deze stap worden alle stickies geplot op de kwaliteits pyramide van Goijko Adzic, deze stap wordt samen met de facilitator(en) gedaan",
  "ppc_sheet3": "Uitleg van de product practices canvas plaat",
  "ppc_sheet3_explanation": "Het canvas bevat 4 gebieden en het proces (de manier waarop) waarin gewerkt wordt. Ieder van de 4 gebieden staat voor een essientiele stap nodig voor de creatie van een succesvol product.",
  "ppc_sheet4": "Plot huidige activiteiten op het gebied IMAGINE IT",
  "ppc_sheet4_explanation": "Plot cur IT",
  "ppc_sheet5": "Plot huidige activiteiten op het gebied BUILD IT",
  "ppc_sheet5_explanation": "QA Engineer",
  "ppc_sheet6": "Plot huidige activiteiten op het gebied  RUN IT",
  "ppc_sheet6_explanation": "Tester",
  "ppc_sheet7": "Plot huidige activiteiten op het gebied (IM)PROVE IT",
  "ppc_sheet7_explanation": "Agile Tester",
  "ppc_sheet8": "Plot huidige activiteiten op het PROCES",
  "ppc_sheet8_explanation": "The canvas...",
  "ppc_sheet9": "Evalueer en bekijk waar je wil verbeteren",
  "ppc_sheet9_explanation": "Plot cur IT",
  "ppc_sheet10": "Beslis over benodigde acties",
  "ppc_sheet10_explanation": "In the area of attention the belonging practices will be shown, the practices chosen for improvement are explained on the back of the card and on the site more information can be found",
  "ppc_sheet11": "www.productpracticescanvas.org",
  "ppc_sheet11_explanation": "Indien je geïnteresseerd bent of je wilt nog wat meer te weten komen over het model, ga dan naar www.productpracticescanvas.org of neem contact op met Daan Koolman of Pascal Dufour",
  "contact_me_title": "Neem contact op via:"
}