{
  "main_function": "QA Engineer",
  "main_qualities": "Test Automatisering | Kwaliteitsproces | Software Testing",
  "menu_resume": "CV",
  "menu_about_me": "Over mij",
  "menu_test": "Test-pagina",
  "menu_projects": "Projecten",
  "menu_contact": "Contact",
  "menu_home": "Home",
  "project_logo_hover": "Klik het logo",
  "project_gallery_close": "Sluit pagina",
  "project1_desc": "Worked in a DevOps team creating a new appearance on the mortgage part of the rabobank (mobile) app and splitting the monorepo into micro-services. I made sure the test-approach suited and we would create a successful product.\nBesides working in the mortgage team I also coached other teams on using data-driven development to improve their product, test automation and worked on a departemental quality vision.",
  "project2_desc": "Worked in two scrum teams focusing on database systems responsible for products and stores. I was responsible to bring quality and testing to the next level.",
  "project3_desc": "I was part of a scrum team where we were realized the first integration tool between FedEx and TNT. Our goal was the create the first tool to integrate TNT and FedEx. Being the QA engineer and scrummaster I set up the testapproach and formed the scrum process. First version of the tool was realized in about 100 days, being able to ship a package where the carrier is decided based on the destination.",
  "project4_desc": "Worked in a scrumteam responsible for creating the restructured and restyled Track & Trace application. After a couple of months the mvp was realized and after it was developed into a mature tool being used in more than 50 countries and 30 languages.",
  "project5_desc": "I was part of a scrum team working on the planning systems for scheduling temporary workers in shifts. I was responsible for guiding the testing process and focus most on the calculation parts of the systems.",
  "project6_desc": "I was as a test coordinator responsible for system tests (ST) and functional acceptance tests of two projects. Project gevangenwezen (GW), Selectie and Leonardo. GW and Selectie are progress applications which run on a Citrix server. In the GW  system detainees are being registered and maintained. In the Selectie system generates local and national reports about the detainees. Leonardo is a project which focused on automated flow of financial information of the detainees throughout all the relevant systems of the ministry.",
  "project7_desc": "In progress",
  "project8_desc": "In progress",
  "project1_results": "• Set up automation tests for the most important business features on UI level, service level, the basics for performance testing and integrated all in the delivery pipeline (CI/CD).\n• Introduced team test sessions and pair testing to make the complete team aware of the product and its quality.\n• I created a team focus on data and results by introducing Google Analytics and setting up the complete data structure and dashboarding. The data was being used for refinements, test and development decisions.\n• Started impact mapping to get focus on the project goal.\n• Front-end bug fixes in Angular and TypeScript.\n• Helped the department with the development of a generic testdata to be able to generate dynamic testdata.\n• Reformed user story template, making sure expectations and criteria were clear and given directions for testing, measuring and development.\n• Set up several test automation frameworks suitable for the different teams across the Rabobank\n• Improved measurement plans for gathering and realizing customer data and dashboards (technical and user data) for several teams.",
  "project2_results": "• Introduced UT PL/SQL for automated unit tests.\n• Created simple and easy to understand test templates.\n• Updated retrospectives to keep on improving with the teams.\n• Pair testing with the developers to create better test awareness.\n• Optimized the software release process by reducing the amount of people to check quality standards (keeping the team responsible).\n• Set up automated tests integrated in jenkins pipeline for the new front end build in Outsystems.",
  "project3_results": "• Set up test automation (CI/CD) for the most important business features, BDD style.\n• Held demo sessions for the department, providing sprint updates and gathering feedback from audience\n• Introduced team test sessions to make team aware of test and quality.\n• Stabilized velocity with the team\n• Facilitated all scrum meetings\n• Worked with 3 amigo sessions\n• Introduced following up at least 2 retropoints every sprint for continuous improvement",
  "project4_results": "• Set up the test automation with BDD\n• Improved the test automation over the E-Commerce department reducing run time by 66%, mainly by focusing on automating only core business functionality\n• Used customer data to make a risk based test approach\n• Held demo festival sessions, interactive style of demoing. People came over at the team to interact with the new build features and respond to future developments\n• Pair testing with developers to spread the quality mindset in the team\n• Organised departemental bughunts, gathering loads of bugs over several applications. Found bugs where prioritized on relevant backlogs by product owners",
  "project5_results": "•\tUsed multiple testing techniques to exhaustively test calculation parts of the system\n•\tIntroducing BDD, setting up scenarios with users and integrate those in user stories\n•\tIntroducing test automation on UI level\n•\tAutomated webservice tests via SoapUI to shorten regression testing feedback time\n•\tSet up performance test for webservices, generating insights on performance trends during developement\n•\tLed UAT sessions with multiple users in a room, gathering defects and possible improvements\n",
  "project6_results": "• Creating a testplanning \n• Creating test plans\n• Writing project progress report\n• Reviewing functional designs, use cases and technical designs\n• Reporting test results in JIRA\n• Executing chain tests\n• Coordinating UAT\n• Writing release advices",
  "project7_results": "In progress",
  "project8_results": "In progress",
  "contact_phone": "06-49966968",
  "contact_skype": "daan_koolman@hotmail.com",
  "contact_mail": "daan@koolit.nl",
  "contact_prof_info": "-Lets make quality a matter of cause-",
  "resume_function": "QA Engineer",
  "resume_profile": "Daan is critical, analytical, has an eye for detail and is eager to create successful products. He aims to focus on customer data to decide on the best test approach including the right balance between automatic and manual tests. He likes to do so in an agile environment and makes quality a team effort with the help of his critical questions. To keep improving and learning he is always up for challenges and trying out new tools or techniques.\nAll is context driven and focused on results. Daan works as a freelancer.",
  "resume_address": "Amsterdam",
  "resume_phone": "06-49966968",
  "resume_email": "daan@koolit.nl",
  "resume_phone_header": "Telefoon",
  "resume_mail_header": "Email",
  "resume_web_header": "Web",
  "resume_address_header": "Adres",
  "resume_job_title1": "Test Consultant",
  "resume_job_title2": "Tester",
  "resume_job_title3": "Tester",
  "resume_job_title4": "Tester",
  "resume_job_title5": "Test Consultant",
  "resume_job_title6": "Agile Tester",
  "resume_job_title7": "QA Engineer",
  "resume_job_title8": "QA Engineer",
  "resume_job_title9": "QA Engineer",
  "resume_job_title10": "QA Engineer",
  "resume_job_title11": "QA Automation Engineer",
  "resume_add_act_title1": "Product Practices Canvas",
  "resume_add_act_desc1": "Developed a model to evaluate the software development process and quality within a team/company. The model provides insights in what a team/organization does to develop a scuccesful product and it hands over practices to improve.",
  "resume_add_act_title2": "Talk about Customer data at Flissi IT (Rabobank)",
  "resume_add_act_desc2": "Talk about gathering user data and applying it in your development proces (focused on Google Analytics).",
  "resume_add_act_title3": "\nCo-organizer Testlab Eurostar Software Test Conference",
  "resume_add_act_desc3": "Set up and prepared robot challenges, blackbox\npuzzels, security test challenges, games, bughunts\nand API test challenges for the Eurostar testlab 2010 Runned the testlab for 4 days on the conference.",
  "resume_add_act_title4": "Talk about Knowing Your Customer at Testnet",
  "resume_add_act_desc4": "Talkaboutwaystogather relevantcustomerdata for you product and how to use this data in your software development process.",
  "resume_skill1": "Agile Ontwikkeling",
  "resume_skill2": "Test Automatisering",
  "resume_skill3": "Exploratief Testen",
  "resume_skill4": "Strategie ontwikkeling",
  "resume_skill5": "Javascript",
  "resume_skill6": "Teamwork",
  "resume_skill7": "Communicatie",
  "resume_skill8": "Kritisch denken",
  "resume_skill9": "Data Analyse",
  "resume_till_now": "04/2020 - heden",
  "resume_skill_header": "Vaardigheden",
  "resume_Profile_header": "Persoonlijke info",
  "resume_experience_header": "Ervaring",
  "resume_education_header": "Opleiding & Cursussen",
  "resume_activities_header": "Neven activiteiten",
  "about_cycling": "Ik kijk graag naar de grote wielerrondes zoals de Giro, Vuelta en Tour the France",
  "about_football": "Ik speel voetbal bij sv. de Meer in Amsterdam en ik kijk graag voetbal met vrienden of gewoon in mijn eentje",
  "about_pubquiz": "Ik doe iedere maand een pubquiz met een groep vrienden, altijd leuk om nieuwe dingen te leren :)",
  "about_ski": "Ik probeer zoveel mogelijk per jaar te skieen, vind ik fantastisch om te doen!",
  "about_mindgames": "Ik hou ervan om uitgedaagd te worden en om perplex te staan. Zodat je geen idee hebt wat er is gebeurd en je in je hoofd flink aan de slag moet om het te begrijpen, zoals bij goochelaars of strategische spellen",
  "about_drinks": "Ik houd er van om zo nu en dan een drankje te doen met een groep vrienden en tevens om uit eten te gaan met vriendin onder het genot van een goed glas wijn",
  "ppc_intro": "The Product Practice Canvas helps a team or organisation to effectively reflect on their current software delivery process and offers practices to improve in the parts needed. Practices are action tools to deliberately get a certain result. Each practice has been developed to improve a specific goal or mitigate a risk/problem. When using the model you start from your current situation and step by step an overview of the desired situation will be created along with practices to implement. The slideshow below walks you through the process:",
  "ppc_sheet1": "Gathering current practices",
  "ppc_sheet1_explanation": "Every participant writes down all the things they do in order to create 'A SUCCESSFUL PRODUCT'",
  "ppc_sheet2": "Plotting practices to the pyramid",
  "ppc_sheet2_explanation": "Here all the stickies are plotted on the quality pyramid of Goijko, this is done together with the facilitator ",
  "ppc_sheet3": "Explain the product practices canvas",
  "ppc_sheet3_explanation": "The canvas contains 4 areas and the process which it all fits in to",
  "ppc_sheet4": "Plot current practices to IMAGINE IT",
  "ppc_sheet4_explanation": "Plot cur IT",
  "ppc_sheet5": "Plot current practices to BUILD IT",
  "ppc_sheet5_explanation": "QA Engineer",
  "ppc_sheet6": "Plot current practices to RUN IT",
  "ppc_sheet6_explanation": "Tester",
  "ppc_sheet7": "Plot current practices to (IM)PROVE IT",
  "ppc_sheet7_explanation": "Agile Tester",
  "ppc_sheet8": "Plot current practices to PROCESS",
  "ppc_sheet8_explanation": "The canvas...",
  "ppc_sheet9": "Evaluate and decide where to improve",
  "ppc_sheet9_explanation": "Plot cur IT",
  "ppc_sheet10": "Practices will be presented to fuel to improvement(s)",
  "ppc_sheet10_explanation": "In the area of attention the belonging practices will be shown, the practices chosen for improvement are explained on the back of the card and on the site more information can be found",
  "ppc_sheet10": "www.productpracticescanvas.org",
  "ppc_sheet10_explanation": "If you are interested or want to know more about the model you can go to www.productpracticescanvas.org, or reach out to Daan Koolman or Pascal Dufour ",
  "contact_me_title": "Contact me"
}