{
  "main_function": "QA Engineer",
  "main_qualities": "Test Automatisering | Kwaliteitsproces | Software Testing",
  "menu_resume": "CV",
  "menu_about_me": "Over mij",
  "menu_test": "Test-pagina",
  "menu_projects": "Projecten",
  "menu_contact": "Contact",
  "menu_home": "Home",
  "project_logo_hover": "Raak het logo aan",
  "project_gallery_close": "Sluit pagina",
  "project_details_activities": "Project details en activiteiten",
  "project_activities": "Activiteiten",
  "project_click_here": "Klik hier",
  "project_tools": "Tools",
  "project_rabo_desc": "Onderdeel van het DevOps team verantwoordelijk voor de creatie van een nieuw uiterlijk van het hypotheek gedeelte van de mobiele rabobank en het opdelen van de monorepo naar micro-services. Ik was verantwoordelijk voor de test aanpak en zorgde ervoor dat we een succesvol product realiseerden.\n Naast mijn werkzaamheden in het hypotheek team heb ik ook andere teams gecoacht op data-driven software ontwikkeling ter verbetering van hun product, test automatisering en gewerkt aan een kwaliteitsvisie voor de afdeling.",
  "project_ah_desc": "Werkte in twee scrums teams met de focus op database systemen verantwoordelijk voor producten en winkels. Ik was verantwoordelijk om testen en daar mee de software kwaliteit naar een hoger plan te tillen.",
  "project_fedex_desc": "Ik was deel van het scrum team verantwoordelijk voor de realisatie van de eerste integratie tool tussen FedEx en TNT. Met deze tool konden klanten een pakket sturen met zowel TNT en FedEx. Als QA engineer en scrum master heb ik de testaanpak opgezet en het scrum proces vormgegeven. De eerste versie van de tool was gereed in ongeveer 100 dagen, hiermee kon een pakket worden verstuurd waarbij het systeem op basis van de bestemming bepaald welke uitvoerder (TNT of FedEx) de zending zou afhandelen.",
  "project_tnt_desc": "Werkte in een scrumteam verantwoordelijk voor het complete vernieuwen van de Track & Trace applicatie. Na een paar maanden was de MVP gerealiseerd waarna het vervolgens is doorontwikkeld tot een applicatie die ge bruikt wordt in meer dan 50 landen met meer dan 30 verschillende talen.",
  "project_rand_desc": "Ik was onderdeel van een scrumteam verantwoordelijk voor het plansysteem waarmee uitzendkrachten werden ingeroosterd. Ik was verantwoordelijk voor het testproces en heb de voornaamste focus gehad op de rekenmodule van het systeem.",
  "project_dji_desc": "Ik was als test coordinator voor de systeem testen (ST) en functionele acceptatie testen (FAT) van twee projecten; Project gevangenwezen (GW), Selectie en project Leonardo. GW en Selectie zijn progress applicaties draaiend op een Citrix server. In het GW systeem worden gevangen geregistreerd, in het Selectie systeem worden lokale en nationale rapportages over gevangen gemaakt. Leonardo is een project over de automatisering van de stroom van financiele gegevens van gedetineerden over alle relevante systemen binnen het ministerie.",
  "project_trans_desc": "Onderdeel van een DevOps team verantwoordelijk voor de boekingen data en de customer service applicatie van Transavia. Ik was verantwoordelijk om de testautomatisering binnen het team te verbeteren, een kwaliteitsfocus binnen het team te realiseren en om het team bekend te maken met het gebruik van data. Echter door het ontstaan van de Coronacrisis eindigde deze opdracht voortijdig.",
  "project_zenly_desc": "Onderdeel van het QA team verantwoordelijk voor alle kwaliteitsaspecten binnen de Zenly mobile app. Ik was verantwoordelijk voor het opzetten van het testautomatiserings framework om UI testen te draaien in de AWS device farm voor zowel Android en iOS.",
  "project_dpg_desc": "Onderdeel van het app team verantwoordelijk voor alle freemium mobiele apps binnen DPG media (AD, PZC, HLN, De Stentor, Tubantia, Eindhovens Dagblad, Brabants Dagblad, 7SUR7, BN de Stem en De Gelderlander). Ik ben verantwoordelijk voor het opzetten het alles gerelateerd aan software kwaliteit voor Android en iOS.",
  "project_rabo_results": "•\t Test automatisering (CI/CD) opgezet voor DevOps teams (Appium, Cucumber + Protractor, Cypress, CodeceptJS, RestAssured, WebdriverIO en Gatling).\n•\tTeam test sessies en pair testing geïntroduceerd om zo product en kwaliteits bewustzijn te creëren.\n•\tIk heb een focus op data en resultaten geïntroduceerd via het gebruik van Google Analytics en het opzetten van een complete data structuur en bijbehorende dashboards. Data werd gebruikt voor refinements, test risico afwegingen en ontwikkel keuzes (Google Analytics, A/B testing, technical statistieken in Kibana).\n•\tRetrospectives geleid.\n•\tHeb het gebruik van impact mapping opgezet om zo focus te krijgen op een duidelijk project doel.\n•\tIk heb diverse teams geholpen bij het opzetten van data dashboards (technische data en klant data).\n•\tHet user story template aangepast om zo duidelijke verwachtingen en criteria naar voren te laten komen die input geven voor het meten van voortgang, test en ontwikkeling. \n•\tEen kwaliteits visie voor de afdeling gerealiseerd \n",
  "project_ah_results": "•\tAutomatische testen opgezet in Java (Selenium) en geïntegreerd in Jenkins voor de nieuw gebouwde front-end in Outsystems\n•\tAutomatische testen opgezet in PL/SQL (unit tests) voor het testen van de database.\n•\tIk heb de retrospectives geupdate om zo te teams zichzelf te blijven laten verbeteren\n•\tPair testen geïntroduceerd om zo de ontwikkelaars een beter bewustzijn van testen bij te brengen\n•\tHet release proces geoptimaliseerd door meer verantwoordelijkheid voor kwaliteit bij het team te leggen in plaats van meerdere mensen documenten te laten afvinken.\n•\tSimpele en makkelijk te gebruiken testtemplates geïntroduceerd\n",
  "project_fedex_results": "•\tTest automatisering opzet (CI/CD) voor de belangrijkste business features op een BDD manier.\n•\tDemo sessies gehouden voor de hele afdeling, hierin werd sprintvoorgang gedeeld en feedback vanuit het publiek opgehaald.\n•\tTeam test sessies opgezet om het team bewuster te maken van het belang van -en hoe te testen.\n•\tScrum bijeenkomsten geleid (Daily Standup, Retrospective, Refinement, Planning, Sprint review, Demo sessies, 3-amigo meetings, Quality guild)\n•\tEen voorspelbaar team neergezet, we wisten precies wat we per sprint konden opleveren en leverden dit ook\n•\tHet opvolgen van ten minste 2 retrospective punten neergezet om zo continue verbetering te waarborgen\n",
  "project_tnt_results": "•\tTest automatisering opgezet via BDD.\n•\tDe test automatisering over de hele E-commerce  afdeling verbeterd waarbij de doorlooptijd van de testen met 66% is gedaald door de automatisering volledig te focussen op de essentiële business functionaliteiten.\n•\tGeruik gemaakt van klantdata als input voor een risico gebaseerde test aanpak.\n•\tDemo festival sessies gehouden, een interactieve manier van demo-en. Mensen lopen langs je bureaus en kunnen daar de software uitproberen via exploratief gedrag of het volgen van een scenario. Dit gaf waardevolle feedback.\n•\tPair testen geïntroduceerd om zo de ontwikkelaars een beter bewustzijn van testen bij te brengen\n•\tBughunts georganiseerd, hierin zijn diverse bugs gevonden in diverse applicaties. Alle gevonden bugs zijn door de betreffende PO’s geanalyseerd en op hun backlog gezet.\n",
  "project_rand_results": "\n•\tBDD geïntroduceerd, door scenarios samen met de gebruikers op te zetten en deze te integreren in user stories.\n•\tMet behulp van diverse testtechnieken heb ik de rekenonderdelen van het systeem doorgrondig getest.\n•\tTestautomatisering op UI level geintroduceerd.\n•\tWebservice testen geautomatiseerd via SoapUI om zo de regressie test feedback te versnellen.\n•\tPerformance testen opgezet voor webservices om zo trends en inzichten te verkrijgen gedurende ontwikkeling.\n•\tUAT sessies geleid waarbij meerdere gebruikers in een ruimte samen kwamen om het product te testen, hierbij zijn bugs en toekomstige verbeteringen verzameld.\n",
  "project_dji_results": "•\tTestplanningen opgezet.\n•\tTestplannen gemaakt.\n•\tTest voortgangsrapportages geschreven.\n•\tFunctionele -, technische designs en use cases gereviewd.\n•\tTestresultaten verwerkt in JIRA.\n•\tKetentesten uitgevoerd.\n•\tRelease vrijgave adviezen geschreven.\n•\tGebruikers testen gecoördineerd.\n",
  "project_trans_results": "•\tHet test automatiserings framework verbeterd voor het team en begonnen met het inzetten hiervan.\n•\tTest bewustzijn bij het team gebracht door pair testen en testdiscussies.\n•\tFunctionele -en technische designs gereviewd.\n",
  "project_zenly_results": "•\tTest automatiserings framework opgezet voor het testen van mobiele telefoons.\n•\tShell scripts geschreven voor het starten van testen, creatie van app downloads en creatie van simulatoren.\n•\t(Automatische) Testen gedraaid in de AWS Device Farm (cloud).\n•\tTestcasemanagement systeem integreren met test automatisering.\n",
  "project_dpg_results": "Wordt aan gewerkt",
  "contact_phone": "06-49966968",
  "contact_skype": "daan_koolman@hotmail.com",
  "contact_mail": "daan@koolit.nl",
  "contact_prof_info": "-Lets make quality a matter of cause-",
  "resume_projects_button": "Naar projecten pagina",
  "resume_function": "QA Engineer",
  "resume_profile": "Daan is kritisch, analytisch sterk, heeft oog voor detail en streeft naar succesvolle producten. Hij gebruikt (klant)data om de beste test aanpak te kiezen bepalen inclusief de balans tussen automatisch en handmatig testen. Daan werkt het liefst in een Agile omgeving waarbij hij door middel van kritische vragen kwaliteit tot een team effort maakt. Hij wordt graag uitgedaagd en probeert altijd nieuwe tools en technieken toe te passen. om zo te blijven leren. Alles wordt context driven toegepast en is gericht op resultaten. Daan werkt als freelancer.",
  "resume_address": "Amsterdam",
  "resume_phone": "06-49966968",
  "resume_email": "daan@koolit.nl",
  "resume_phone_header": "Telefoon",
  "resume_mail_header": "Email",
  "resume_web_header": "Web",
  "resume_address_header": "Adres",
  "resume_job_title1": "Test Consultant",
  "resume_job_title2": "Tester",
  "resume_job_title3": "Tester",
  "resume_job_title4": "Tester",
  "resume_job_title5": "Test Consultant",
  "resume_job_title6": "Agile Tester",
  "resume_job_title7": "QA Engineer",
  "resume_job_title8": "QA Engineer",
  "resume_job_title9": "QA Engineer",
  "resume_job_title10": "QA Engineer",
  "resume_job_title11": "QA Automation Engineer",
  "resume_add_act_title1": "Product Practices Canvas",
  "resume_add_act_desc1": "Model ontwikkelt om het software ontwikkel proces en kwaliteit binnen een team/organisatie inzichtelijk te maken. Het model laat zien wat een team/organisatie doet om een succesvol product te realiseren en het biedt ‘practices’ om verbeteringen door te voeren.",
  "resume_add_act_title2": "'Customer data' presentatie op Flissi IT (Rabobank)",
  "resume_add_act_desc2": "Presentatie over verzamelen van gebruikers gegevens en hoe deze toe te passen in je ontwikkel proces (focus op Google Analytics).",
  "resume_add_act_title3": "Medeorganisator Testlab Eurostar Software Test Conference",
  "resume_add_act_desc3": "Robot challenges, blackbox puzzels, security test challenges, games, bughunts en API test challenges opgezet en gefaciliteerd voor het Eurostar testlab.\nBemande het testlab voor 4 dagen op de conferentie.",
  "resume_add_act_title4": "'Know your customer' presentatie op Testnet",
  "resume_add_act_desc4": "Presentatie over diverse manieren om relevante klantdata te verzamelen en hoe je deze in kan zetten in het software ontwikkel proces.",
  "resume_skill1": "Agile Ontwikkeling",
  "resume_skill2": "Test Automatisering",
  "resume_skill3": "Exploratief Testen",
  "resume_skill4": "Strategie ontwikkeling",
  "resume_skill5": "Javascript",
  "resume_skill6": "Teamwork",
  "resume_skill7": "Communicatie",
  "resume_skill8": "Kritisch denken",
  "resume_skill9": "Data Analyse",
  "resume_till_now": "heden",
  "resume_skill_header": "Vaardigheden",
  "resume_Profile_header": "Persoonlijke info",
  "resume_experience_header": "Ervaring",
  "resume_education_header": "Opleiding & Cursussen",
  "resume_activities_header": "Neven activiteiten",
  "about_cycling": "Ik kijk graag naar de grote wielerrondes zoals de Giro, Vuelta en Tour the France",
  "about_football": "Ik speel voetbal bij sv. de Meer in Amsterdam en ik kijk graag voetbal met vrienden of gewoon in mijn eentje",
  "about_pubquiz": "Ik doe iedere maand een pubquiz met een groep vrienden, altijd leuk om nieuwe dingen te leren :)",
  "about_ski": "Ik probeer zoveel mogelijk per jaar te skieen, vind ik fantastisch om te doen!",
  "about_mindgames": "Ik hou ervan om uitgedaagd te worden en om perplex te staan. Zodat je geen idee hebt wat er is gebeurd en je in je hoofd flink aan de slag moet om het te begrijpen, zoals bij goochelaars of strategische spellen",
  "about_drinks": "Ik houd er van om zo nu en dan een drankje te doen met een groep vrienden en tevens om uit eten te gaan met vriendin onder het genot van een goed glas wijn",
  "ppc_intro": "Verbeter je ontwikkelproces met het product practices canvas! Zie voor meer informatie  ",
  "ppc_sheet1": "Wat doe jij om een succesvol product te creëren",
  "ppc_sheet1_explanation": "Iedere deelnemer schrijft op stickies wat zij doen aan activiteiten en technieken om een succesvol product te creëren",
  "ppc_sheet2": "Plot de stickies op de kwaliteits piramide",
  "ppc_sheet2_explanation": "In deze stap worden alle stickies geplot op de kwaliteits pyramide van Goijko Adzic, deze stap wordt samen met de facilitator(en) gedaan",
  "ppc_sheet3": "Uitleg van de product practices canvas plaat",
  "ppc_sheet3_explanation": "Het canvas bevat 4 gebieden en het proces (de manier waarop) waarin gewerkt wordt. Ieder van de 4 gebieden staat voor een essientiele stap nodig voor de creatie van een succesvol product.",
  "ppc_sheet4": "Plot huidige activiteiten op het gebied IMAGINE IT",
  "ppc_sheet4_explanation": "Welke van de huidige activiteiten, zoals op stickies gezet in het begin, worden gebruikt om een duidelijk doel te formuleren bij het bouwen van het product?",
  "ppc_sheet5": "Plot huidige activiteiten op het gebied BUILD IT",
  "ppc_sheet5_explanation": "Welke van de huidige activiteiten, zoals op stickies gezet in het begin, worden gebruikt om de juiste software te bouwen?",
  "ppc_sheet6": "Plot huidige activiteiten op het gebied  RUN IT",
  "ppc_sheet6_explanation": "Welke van de huidige activiteiten, zoals op stickies gezet in het begin, worden gebruikt om de gebouwde software te beheren?",
  "ppc_sheet7": "Plot huidige activiteiten op het gebied (IM)PROVE IT",
  "ppc_sheet7_explanation": "Welke van de huidige activiteiten, zoals op stickies gezet in het begin, worden gebruikt om te gebouwde software te verbeteren?",
  "ppc_sheet8": "Plot huidige activiteiten op het PROCES",
  "ppc_sheet8_explanation": "Welke van de huidige activiteiten, zoals op stickies gezet in het begin, worden toegepast in het proces waarin de software ontwikkeld wordt?",
  "ppc_sheet9": "Evalueer en bekijk waar je wil verbeteren",
  "ppc_sheet9_explanation": "De Canvas is nu volledig gevuld met de huidige activiteiten, het team kan nu goed nu bediscussiëren of ze iets op vinden vallen en waar ze graag verbeteringen zouden willen doorvoeren.",
  "ppc_sheet10": "Beslis over benodigde acties",
  "ppc_sheet10_explanation": "In de gebieden waar het team actie/verbetering wil ondernemen worden practice kaarten voor verbeteringen getoond. De facilitatoren leggen de kaarten uit en op de voorkant van elke kaart staat de techniek/methode en op de achterkant is deze uitgelegd. Tevens kan er op de site meer informatie meer informatie over de practice gevonden worden. Het team kiest nu hun verbeteringpunten uit.",
  "ppc_sheet11": "www.productpracticescanvas.org",
  "ppc_sheet11_explanation": "Indien je geïnteresseerd bent of je wilt nog wat meer te weten komen over het model, ga dan naar www.productpracticescanvas.org of neem contact op met Daan Koolman of Pascal Dufour",
  "ppc_play": "Speel slide show af",
  "ppc_full_screen":"Volledig scherm",
  "contact_me_title": "Neem contact op via:"
}







